finger563/lpc2148_freeRTOS/src/scifu/drv/lpc2xxx/CAN/LPC2000_CAN_Driver.c
   OUTB( Address_CMR, Transmit_TxBuf_Start );

   while ( (INW(Address_GSR) & 0x0048) == 0x0000 );  // Wait Trans successed or error counter reach limit

   if( (INW(Address_GSR) & 0x0040) == 0x0040 ) 		 // if error, stop transmit
   {												 // for demo used, stop screen roll
   OUTB( Address_CMR, 0x02 );                        
	}												 

   return (LPC2000_CANDRIVER_OK);

}  // lpc2000CANdriver_PrepareTransmitMessage; 




// **************************************************************************
// FUNCTION:    lpc2000CANdriver_ReceiveMessageCh1                                
//                                                                           
// DESCRIPTION: This function reads the received CAN message and stores      
//              the data in the CPU User RAM                                 
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:      CanStatusCode: Status of operation                           
//                                                                           
//              LPC2000_CANDRIVER_OK - successful                                 
//                                                                           
// **************************************************************************

CanStatusCode
lpc2000CANdriver_ReceiveMessageCh1 (plpc2000CANdriver_RXObj_t   pReceiveBuf)
{

   // CAN Channel 1 

   pReceiveBuf -> RFS = CAN1RFS;
   pReceiveBuf -> ID = CAN1RID;

   pReceiveBuf -> DataField[0] = CAN1RDA;
   pReceiveBuf -> DataField[1] = CAN1RDB;

   // Release Receive Buffer 

   CAN1CMR = 0x04;                 // Release Rx Buffer


   return (1);
}   // lpc2000CANdriver_ReceiveMessageCh0; 



// **************************************************************************
// FUNCTION:    lpc2000CANdriver_ReceiveMessageCh2                                
//                                                                           
// DESCRIPTION: This function reads the received CAN message and stores      
//              the data in the CPU User RAM                                 
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:      CanStatusCode: Status of operation                           
//                                                                           
//              LPC2000_CANDRIVER_OK - successful                                 
//                                                                           
// **************************************************************************

CanStatusCode
lpc2000CANdriver_ReceiveMessageCh2 (plpc2000CANdriver_RXObj_t   pReceiveBuf)
{
   // CAN Channel 2 

   pReceiveBuf -> RFS = CAN2RFS;
   pReceiveBuf -> ID = CAN2RID;

   pReceiveBuf -> DataField[0] = CAN2RDA;
   pReceiveBuf -> DataField[1] = CAN2RDB;

   // Release Receive Buffer 

   CAN2CMR = 0x04;      // Release Rx Buffer


   return (1);
}   // lpc2000CANdriver_ReceiveMessageCh2; 

// **************************************************************************
// FUNCTION:    lpc2000CANdriver_ReceiveMessageCh3                                
//                                                                           
// DESCRIPTION: This function reads the received CAN message and stores      
//              the data in the CPU User RAM                                 
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:      CanStatusCode: Status of operation                           
//                                                                           
//              LPC2000_CANDRIVER_OK - successful                                 
//                                                                           
// **************************************************************************

CanStatusCode
lpc2000CANdriver_ReceiveMessageCh3 (plpc2000CANdriver_RXObj_t   pReceiveBuf)
{

   // CAN Channel 3 

   /*pReceiveBuf -> RFS = CAN3RFS;
   pReceiveBuf -> ID = CAN3RID;

   pReceiveBuf -> DataField[0] = CAN3RDA;
   pReceiveBuf -> DataField[1] = CAN3RDB;

   // Release Receive Buffer 

   CAN3CMR = 0x04;                 // Release Rx Buffer
*/

   return (1);
}   // lpc2000CANdriver_ReceiveMessageCh3; 

// **************************************************************************
// FUNCTION:    lpc2000CANdriver_ReceiveMessageCh4                                
//                                                                           
// DESCRIPTION: This function reads the received CAN message and stores      
//              the data in the CPU User RAM                                 
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:      CanStatusCode: Status of operation                           
//                                                                           
//              LPC2000_CANDRIVER_OK - successful                                 
//                                                                           
// **************************************************************************

CanStatusCode
lpc2000CANdriver_ReceiveMessageCh4 (plpc2000CANdriver_RXObj_t   pReceiveBuf)
{

   // CAN Channel 4 
/*
   pReceiveBuf -> RFS = CAN4RFS;
   pReceiveBuf -> ID = CAN4RID;

   pReceiveBuf -> DataField[0] = CAN4RDA;
   pReceiveBuf -> DataField[1] = CAN4RDB;

   // Release Receive Buffer 

   CAN4CMR = 0x04;          // Release Rx Buffer

*/
   return (1);
}   // lpc2000CANdriver_ReceiveMessageCh4; 





