finger563/lpc2148_freeRTOS/src/scifu/drv/lpc2xxx/CAN/LPC2000_CAN_Driver.c
  Print_Chars_to_Screen( Rcv_Data_To_Screen_4 );
  if( i == 0)
    {
      Temp_Data_Output[0] &= 0x000003FF;
	  Temp_Data_Output[1] = Temp_Data_Output[0] / 1000;
      Print_4bits_to_Screen( Temp_Data_Output[1] );      // print ID Index thousand digit
	  Temp_Data_Output[0] %= 1000;
      Temp_Data_Output[1] = Temp_Data_Output[0] / 100;
      Print_4bits_to_Screen( Temp_Data_Output[1] );      // print ID Index centi-digit
	  Temp_Data_Output[0] %= 100;
      Temp_Data_Output[1] = Temp_Data_Output[0] / 10;
      Print_4bits_to_Screen( Temp_Data_Output[1] );      // print ID Index deca-digit
	  Temp_Data_Output[0] %= 10;
      Print_4bits_to_Screen( Temp_Data_Output[0] );      // print ID Index below ten digit
    }
  else
    { for(i=0;i<4;i++) Print_4bits_to_Screen( 45 );}	 // print 4 "-"

  Print_Chars_to_Screen( Rcv_Data_To_Screen_5 );		 // change line + line feed

  return(0);
}

// **************************************************************************
// FUNCTION:    Print_Chars_to_Screen                             
//                                                                           
// DESCRIPTION: Print Chars to Screen by Uart0     
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:           
// **************************************************************************
UInt32 Print_Chars_to_Screen(  UInt8 const * pscreen_print )
{
  while( *pscreen_print != '\0' )
    {
	  U0THR = *pscreen_print;
	  while( (U0LSR & 0x20) == 0 );
	  pscreen_print++;
	}
 return(0);
}

// **************************************************************************
// FUNCTION:    Print_4bits_to_Screen                             
//                                                                           
// DESCRIPTION: Print 4bits hex data to Screen by Uart0     
//                                                                           
// GLOBAL VARIABLES USED:                                                    
//                                                                           
// PARAMETERS:                                                               
//                                                                           
// RETURN:           
// **************************************************************************
UInt32 Print_4bits_to_Screen( UInt32 Value_Hex_4bits)
{
  switch(Value_Hex_4bits)
    {
	  case 0:
	  case 1:
	  case 2:
	  case 3:
	  case 4:
	  case 5:
	  case 6:
	  case 7:
	  case 8:
	  case 9: U0THR = Value_Hex_4bits + 48;  // print "0 - 9"
	    break;
	  case 10:
	  case 11:
	  case 12:
	  case 13:
	  case 14:
	  case 15: U0THR = Value_Hex_4bits + 55; // print "A - F"
	    break;
      case 44:                               // print ","
      case 45: U0THR = Value_Hex_4bits;      // print "-"
		break;
	  default:	    
	    break;
	}
  while( (U0LSR & 0x20) == 0 );
  return(0);
}